from collections import deque
# BFS 예제 풀어보기

# -------------------------------------------------------------------
# 개인 풀이
# -------------------------------------------------------------------
graph = [
    [],
    [2,3,8],
    [1,7],
    [1,4,5],
    [3,5],
    [3,4],
    [7],
    [2,6,8],
    [1,7]
]

# BSF 구현 해보기
def bfs (graph, start, visited):
    # 시작 노드로 큐 초기화
    dq = deque([start])

    # 현재 노드 방문
    visited[start] = True

    # 큐가 빌 때까지 반복
    while dq:
        # 큐에서 하나의 원소를 뽑아 출력
        v = dq.popleft()
        print(v, end=' ')

        # 해당 원소와 연결된, 아직 방문하지 않은 원소들을 큐에 삽입
        for g in graph[v]:
            if not visited[g]:
                dq.append(g)
                visited[g] = True

visited = [False] * 9

bfs(graph, 1, visited)

# -------------------------------------------------------------------
# 책 답변 5-9
# -------------------------------------------------------------------

# -------------------------------------------------------------------
# 오답노트
# -------------------------------------------------------------------
